!pip install pandas
!pip install openpyxl

In [3]:
import pandas as pd

## Load dataset 1 (review count)

In [10]:
review_count_file_name = '../crawling/review_count.xlsx'
review_count_df = pd.read_excel(review_count_file_name)

In [11]:
review_count_df

   Unnamed: 0        가계명     placeid  review_count
0           0  사위식당 정자본점  1017221386           769
1           1    진대감 분당점  1567653802           166

## Load dataset 2 (place data)

In [13]:
place_data_file_name = './place_data.xlsx'
place_data_df = pd.read_excel(place_data_file_name)

In [14]:
place_data_df

   Unnamed: 0        가계명     placeid 운영여부
0           0  사위식당 정자본점  1017221386    O
1           1    진대감 분당점  1567653802    X

## join

In [79]:
left_df = review_count_df[['placeid', 'review_count']]
right_df = place_data_df[['placeid', '가계명', '운영여부']]

merged_df = pd.merge(left_df, right_df, left_on='placeid', right_on='placeid', how='left', validate='one_to_one')

In [80]:
merged_df

      placeid  review_count        가계명 운영여부
0  1017221386           769  사위식당 정자본점    O
1  1567653802           166    진대감 분당점    X

In [82]:
result_df = merged_df.copy()

result_df.insert(0, 'index', result_df.index)

In [83]:
result_df

   index     placeid  review_count        가계명 운영여부
0      0  1017221386           769  사위식당 정자본점    O
1      1  1567653802           166    진대감 분당점    X

# result

In [84]:
import openpyxl

template_file_path = './result_template.xlsx'
wb = openpyxl.load_workbook(template_file_path)
ws = wb.active

In [87]:
from openpyxl.utils.dataframe import dataframe_to_rows
row_list = dataframe_to_rows(result_df, index=False, header=False)

start_row = 2
start_col = 1
for r_idx, row in enumerate(row_list, start_row):
    for c_idx, value in enumerate(row, start_col):
        ws.cell(row=r_idx, column=c_idx, value=value)
#         print(value)

In [91]:
df = pd.DataFrame(ws.values)
df

     0           1        2          3     4     5            6
0  NaN         가계명  placeid       운영여부  리뷰숫자  None         None
1  0.0  1017221386      769  사위식당 정자본점     O     O         None
2  1.0  1567653802      166    진대감 분당점     X     X  이건 템플릿 입니다.

In [92]:
result_file_path = './result.xlsx'
wb.save(result_file_path)